app/views/pages/home.html.erb

SELECT "sociallinks".* FROM "sociallinks"
---
    <ul>
      <% Sociallink.all.each do |sociallink| %>